#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
tf/env/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/tcry.pt/tcry.pt/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/tcry.pt/tcry.pt

To view this run in a browser, visit:
https://app.terraform.io/app/tcrypt/production-tcrypt/runs/run-zocmsnKptGJaB1DA

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.tcrypt.data.template_file.cloud_init: Refreshing state... [id=5db985ed8a369b7a1098e0dcf68f946546a6b54de79a44060240c637b6f9bea4]
module.tcrypt.digitalocean_vpc.region_1: Refreshing state... [id=2b0aaf42-a9b4-4226-aeb3-32acc2973103]
module.tcrypt.digitalocean_volume.storage_1: Refreshing state... [id=ebf89721-1338-11eb-9461-0a58ac1420e9]
module.tcrypt.digitalocean_droplet.compute_workers_region_1[0]: Refreshing state... [id=216478801]
module.tcrypt.digitalocean_droplet.compute_workers_region_1[1]: Refreshing state... [id=216478799]
module.tcrypt.digitalocean_floating_ip.proxy_1: Refreshing state... [id=167.172.9.215]
module.tcrypt.digitalocean_domain.root: Refreshing state... [id=tcry.pt]
module.tcrypt.digitalocean_record.mail_mx["1"]: Refreshing state... [id=120617218]
module.tcrypt.digitalocean_record.mail_verification["2"]: Refreshing state... [id=120617226]
module.tcrypt.digitalocean_record.mail_cname["0"]: Refreshing state... [id=120617219]
module.tcrypt.digitalocean_record.mail_cname["1"]: Refreshing state... [id=120617223]
module.tcrypt.digitalocean_record.mail_cname["2"]: Refreshing state... [id=120617222]
module.tcrypt.digitalocean_record.code: Refreshing state... [id=120617221]
module.tcrypt.digitalocean_record.mail_verification["1"]: Refreshing state... [id=120617220]
module.tcrypt.digitalocean_record.mail_mx["0"]: Refreshing state... [id=120617224]
module.tcrypt.digitalocean_record.mail_verification["0"]: Refreshing state... [id=120617225]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tcrypt.digitalocean_droplet.compute_workers_region_2[0] will be created
  + resource "digitalocean_droplet" "compute_workers_region_2" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = true
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "compute-workerr-sfo2-0"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "sgp1"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = "9ecb6538e62b29cae58bc8869e0b8b1a21d06b9f"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.tcrypt.digitalocean_vpc.region_2 will be created
  + resource "digitalocean_vpc" "region_2" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.4.0.0/20"
      + name       = "tcrypt-production-sgp1"
      + region     = "sgp1"
      + urn        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @tyler-smith, Action: `pull_request`*